export const CLOTHES_DATA = [
  {
    name: '민소매',
  },
  {
    name: '반팔',
  },
  {
    name: '반바지',
  },
  {
    name: '짧은 치마',
  },
  {
    name: '린넨 옷',
  },
  {
    name: '반팔티',
  },
  {
    name: '얇은 셔츠',
  },
  {
    name: '면바지',
  },
  {
    name: '원피스',
  },
  {
    name: '긴팔티',
  },
  {
    name: '얇은 가디건',
  },
  {
    name: '청바지',
  },
  {
    name: '블라우스',
  },
  {
    name: '슬랙스',
  },
  {
    name: '7부바지',
  },
  {
    name: '얇은 재킷',
  },
  {
    name: '맨투맨',
  },
  {
    name: '후드',
  },
  {
    name: '긴바지',
  },
  {
    name: '바람막이',
  },
  {
    name: '야상',
  },
  {
    name: '니트',
  },
  {
    name: '살구색 스타킹',
  },
  {
    name: '청자켓',
  },
  {
    name: '기모 후드',
  },
  {
    name: '항공점퍼',
  },
  {
    name: '셔츠',
  },
  {
    name: '재킷',
  },
  {
    name: '트렌치코트',
  },
  {
    name: '검은색 스타킹',
  },
  {
    name: '울코트',
  },
  {
    name: '가죽 재킷',
  },
  {
    name: '스카프',
  },
  {
    name: '두꺼운 바지',
  },
  {
    name: '가죽 옷',
  },
  {
    name: '히트텍',
  },
  {
    name: '캐시미어 코트',
  },
  {
    name: '플리스 재킷',
  },
  {
    name: '경량패딩',
  },
  {
    name: '목폴라',
  },
  {
    name: '패딩',
  },
  {
    name: '두꺼운 코트',
  },
  {
    name: '목도리',
  },
  {
    name: '기모제품',
  },
  {
    name: '누빔옷',
  },
  {
    name: '장갑',
  },
  {
    name: '히트텍',
  },
  {
    name: '발열내의',
  },
  {
    name: '가디건',
  },
];

export const WEATHER_DATA = [
  { name: '매우 더움', degree: 8 },
  { name: '더움', degree: 7 },
  { name: '조금 더움', degree: 6 },
  { name: '따듯함', degree: 5 },
  { name: '선선함', degree: 4 },
  { name: '조금 추움', degree: 3 },
  { name: '추움', degree: 2 },
  { name: '매우 추움', degree: 1 },
];

export const WEATHER_TO_CLOTHES_MAP = {
  '매우 더움': ['민소매', '반팔', '반바지', '짧은 치마', '린넨 옷'],
  더움: ['반팔티', '얇은 셔츠', '반바지', '면바지', '원피스', '린넨 옷'],
  '조금 더움': [
    '긴팔티',
    '얇은 가디건',
    '면바지',
    '청바지',
    '블라우스',
    '슬랙스',
    '7부바지',
  ],
  따듯함: [
    '얇은 재킷',
    '가디건',
    '맨투맨',
    '면바지',
    '청바지',
    '후드',
    '긴바지',
    '바람막이',
  ],
  선선함: [
    '얇은 재킷',
    '가디건',
    '야상',
    '맨투맨',
    '니트',
    '살구색 스타킹',
    '청자켓',
    '야상',
    '기모 후드',
    '셔츠',
  ],
  '조금 추움': [
    '재킷',
    '트렌치코트',
    '니트',
    '면바지',
    '청바지',
    '검은색 스타킹',
    '야상',
    '항공점퍼',
  ],
  추움: [
    '울코트',
    '가죽 재킷',
    '니트',
    '스카프',
    '두꺼운 바지',
    '가죽 옷',
    '히트텍',
    '캐시미어 코트',
    '플리스 재킷',
    '경량패딩',
    '목폴라',
  ],
  '매우 추움': [
    '패딩',
    '두꺼운 코트',
    '목도리',
    '기모제품',
    '누빔옷',
    '장갑',
    '히트텍',
    '발열내의',
    '목폴라',
  ],
};
